_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 15000, 1)          0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 4995, 256)         4352      
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 1249, 256)         0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 417, 256)          524544    
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 105, 256)          0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 105, 32)           36992     
_________________________________________________________________
flatten_1 (Flatten)          (None, 3360)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 3360)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               336100    
=================================================================
Total params: 901,988
Trainable params: 901,988
Non-trainable params: 0
_________________________________________________________________
