{
  "name": "model_1",
  "layers": [
    {
      "name": "input_1",
      "class_name": "InputLayer",
      "config": {
        "batch_input_shape": [
          null,
          15000,
          1
        ],
        "dtype": "float32",
        "sparse": false,
        "name": "input_1"
      },
      "inbound_nodes": []
    },
    {
      "name": "conv1d_1",
      "class_name": "Conv1D",
      "config": {
        "name": "conv1d_1",
        "trainable": true,
        "filters": 256,
        "kernel_size": [
          16
        ],
        "strides": [
          3
        ],
        "padding": "valid",
        "dilation_rate": [
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "inbound_nodes": [
        [
          [
            "input_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "max_pooling1d_1",
      "class_name": "MaxPooling1D",
      "config": {
        "name": "max_pooling1d_1",
        "trainable": true,
        "strides": [
          4
        ],
        "pool_size": [
          4
        ],
        "padding": "same"
      },
      "inbound_nodes": [
        [
          [
            "conv1d_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "conv1d_2",
      "class_name": "Conv1D",
      "config": {
        "name": "conv1d_2",
        "trainable": true,
        "filters": 256,
        "kernel_size": [
          8
        ],
        "strides": [
          3
        ],
        "padding": "same",
        "dilation_rate": [
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "inbound_nodes": [
        [
          [
            "max_pooling1d_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "max_pooling1d_2",
      "class_name": "MaxPooling1D",
      "config": {
        "name": "max_pooling1d_2",
        "trainable": true,
        "strides": [
          4
        ],
        "pool_size": [
          4
        ],
        "padding": "same"
      },
      "inbound_nodes": [
        [
          [
            "conv1d_2",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "lstm_1",
      "class_name": "LSTM",
      "config": {
        "name": "lstm_1",
        "trainable": true,
        "return_sequences": true,
        "return_state": false,
        "go_backwards": false,
        "stateful": false,
        "unroll": false,
        "units": 32,
        "activation": "tanh",
        "recurrent_activation": "hard_sigmoid",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "recurrent_initializer": {
          "class_name": "Orthogonal",
          "config": {
            "gain": 1,
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "unit_forget_bias": true,
        "kernel_regularizer": null,
        "recurrent_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "recurrent_constraint": null,
        "bias_constraint": null,
        "dropout": 0,
        "recurrent_dropout": 0,
        "implementation": 1
      },
      "inbound_nodes": [
        [
          [
            "max_pooling1d_2",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "flatten_1",
      "class_name": "Flatten",
      "config": {
        "name": "flatten_1",
        "trainable": true
      },
      "inbound_nodes": [
        [
          [
            "lstm_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "dropout_1",
      "class_name": "Dropout",
      "config": {
        "name": "dropout_1",
        "trainable": true,
        "rate": 0.2,
        "noise_shape": null,
        "seed": null
      },
      "inbound_nodes": [
        [
          [
            "flatten_1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "dense_1",
      "class_name": "Dense",
      "config": {
        "name": "dense_1",
        "trainable": true,
        "units": 100,
        "activation": "softmax",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "inbound_nodes": [
        [
          [
            "dropout_1",
            0,
            0,
            {}
          ]
        ]
      ]
    }
  ],
  "input_layers": [
    [
      "input_1",
      0,
      0
    ]
  ],
  "output_layers": [
    [
      "dense_1",
      0,
      0
    ]
  ]
}